<?php

return [

    'title' => 'إدارة المستخدمين',
    'users' => "المستخدمون",
    'list' => 'قائمة المستخدمين',
    'create' => 'إضافة مستخدم',
    'edit' => 'تعديل المستخدم',
    'delete' => 'حذف المستخدم',
    'show' => "الملف الشخصي : :name",
    'new' => 'مستخدم جديد',

    'form' => [
        'base_info' => 'المعلومات الأساسية',
        'roles_permissions' => 'الأدوار والصلاحيات',
    ],

    'fields' => [
        'first_name' => 'الاسم الأول',
        'last_name' => 'اسم العائلة',
        'email' => 'البريد الإلكتروني',
        'status' => 'الحالة',
        'status_active' => 'نشط',
        'status_inactive' => 'غير نشط',
        'password' => 'كلمة المرور',
        'password_hint' => 'استخدم 8 أحرف أو أكثر مع مزيج من الحروف والأرقام والرموز.',
        'phone' => 'رقم الهاتف',
        'gender' => 'الجنس',
        'male' => 'ذكر',
        'female' => 'أنثى',
        'birth_date' => 'تاريخ الميلاد',
        'select_date' => 'اختر تاريخًا',
        'profile_photo' => 'صورة الملف الشخصي',
        'roles_permissions' => 'الأدوار والصلاحيات',
        'role' => 'الدور',
        'last_activity' => 'آخر نشاط',
    ],

    'filter' => [
        'name' => 'التصفية حسب الاسم',
        'role' => 'التصفية حسب الدور',
    ]

];
